In [3]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%%sql

show tables;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('demo',)]

In [8]:
%%sql

show databases;

 * mysql+mysqlconnector://root:***@localhost/test
8 rows affected.

[('de_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [6]:
%%sql

create database de_project

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.DatabaseError) 1007 (HY000): Can't create database 'de_project'; database exists
[SQL: create database de_project]
(Background on this error at: https://sqlalche.me/e/20/4xp6)

In [9]:
%%sql

show databases;

 * mysql+mysqlconnector://root:***@localhost/test
8 rows affected.

[('de_project',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [10]:
%%sql

use de_project;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [11]:
%%sql

create table testv1 (
    sno int,
    name varchar(100)
);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'testv1' already exists
[SQL: create table testv1 (
    sno int,
    name varchar(100)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [12]:
%%sql

select * from testv1;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'sam')]

In [13]:
%%sql

insert into testv1 (sno,name) values(1,'sam');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[(1, 'sam')]

In [14]:
%%sql

alter table testv1 rename to sam1

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [15]:
%%sql

show tables;

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[('sam1',)]

In [ ]:
#---------------------------------------------------------where ------------------------------------------------------

In [20]:
%%sql

create table rides(
    ride_id INT PRIMARY KEY,
    driver_id INT,
    rider_id INT,
    pickup_location VARCHAR(100), 
    drop_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [21]:
%%sql

show tables;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[('rides',), ('sam1',)]

In [26]:
%%sql
select * from rides

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[(1, 101, 201, 'New York', 'Los Angeles', datetime.datetime(2025, 2, 21, 10, 0), Decimal('250.50')),
 (2, 102, 202, 'San Francisco', 'Las Vegas', datetime.datetime(2025, 2, 21, 12, 30), Decimal('180.75')),
 (3, 103, 203, 'Chicago', 'Houston', datetime.datetime(2025, 2, 21, 15, 45), Decimal('200.00')),
 (4, 104, 204, 'Miami', 'Orlando', datetime.datetime(2025, 2, 21, 18, 10), Decimal('75.25')),
 (5, 105, 205, 'Seattle', 'Portland', datetime.datetime(2025, 2, 21, 9, 20), Decimal('90.30')),
 (6, 106, 206, 'Boston', 'New Jersey', datetime.datetime(2025, 2, 21, 11, 15), Decimal('120.00')),
 (7, 107, 207, 'Dallas', 'Austin', datetime.datetime(2025, 2, 21, 14, 0), Decimal('60.40')),
 (8, 108, 208, 'Denver', 'Salt Lake City', datetime.datetime(2025, 2, 21, 16, 25), Decimal('150.60')),
 (9, 109, 209, 'Atlanta', 'Charlotte', datetime.datetime(2025, 2, 21, 19, 50), Decimal('95.80')),
 (10, 110, 210, 'Phoenix', 'San Diego', datetime.datetime(2025, 2, 21, 21, 30), Decimal('130.90'))]

In [25]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, drop_location, ride_date, fare) VALUES
(1, 101, 201, 'New York', 'Los Angeles', '2025-02-21 10:00:00', 250.50),
(2, 102, 202, 'San Francisco', 'Las Vegas', '2025-02-21 12:30:00', 180.75),
(3, 103, 203, 'Chicago', 'Houston', '2025-02-21 15:45:00', 200.00),
(4, 104, 204, 'Miami', 'Orlando', '2025-02-21 18:10:00', 75.25),
(5, 105, 205, 'Seattle', 'Portland', '2025-02-21 09:20:00', 90.30),
(6, 106, 206, 'Boston', 'New Jersey', '2025-02-21 11:15:00', 120.00),
(7, 107, 207, 'Dallas', 'Austin', '2025-02-21 14:00:00', 60.40),
(8, 108, 208, 'Denver', 'Salt Lake City', '2025-02-21 16:25:00', 150.60),
(9, 109, 209, 'Atlanta', 'Charlotte', '2025-02-21 19:50:00', 95.80),
(10, 110, 210, 'Phoenix', 'San Diego', '2025-02-21 21:30:00', 130.90);

 * mysql+mysqlconnector://root:***@localhost/test
10 rows affected.

[]

In [31]:
%%sql

select * from rides 
where fare >'100';

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[(1, 101, 201, 'New York', 'Los Angeles', datetime.datetime(2025, 2, 21, 10, 0), Decimal('250.50')),
 (2, 102, 202, 'San Francisco', 'Las Vegas', datetime.datetime(2025, 2, 21, 12, 30), Decimal('180.75')),
 (3, 103, 203, 'Chicago', 'Houston', datetime.datetime(2025, 2, 21, 15, 45), Decimal('200.00')),
 (6, 106, 206, 'Boston', 'New Jersey', datetime.datetime(2025, 2, 21, 11, 15), Decimal('120.00')),
 (8, 108, 208, 'Denver', 'Salt Lake City', datetime.datetime(2025, 2, 21, 16, 25), Decimal('150.60')),
 (10, 110, 210, 'Phoenix', 'San Diego', datetime.datetime(2025, 2, 21, 21, 30), Decimal('130.90'))]